
## Plan Result




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.api_mgmt_product.azurerm_api_management_product.product
  * module.apim_apis.azurerm_api_management_api.apim_api
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation.apim_api_operation[&#34;update-publication&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;publication-health&#34;]
  * module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies[&#34;update-publication&#34;]
  * module.apim_apis.azurerm_api_management_api_policy.apim_api_policy
  * module.apim_apis.azurerm_api_management_product_api.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api_mgmt_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = false
      + display_name          = "hmi-product-stg"
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = true
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = false
      + subscriptions_limit   = 20
    }

  # module.apim_apis.data.azurerm_api_management_product.apim_product will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_api_management_product" "apim_product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = (known after apply)
      + description           = (known after apply)
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + product_id            = "hmi-product-stg"
      + published             = (known after apply)
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = (known after apply)
      + subscriptions_limit   = (known after apply)
      + terms                 = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api.apim_api will be created
  + resource "azurerm_api_management_api" "apim_api" {
      + api_management_name   = "sds-api-mgmt-stg"
      + api_type              = (known after apply)
      + display_name          = "hmi APIM API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "hmi-APIM"
      + path                  = "hmi"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "ss-stg-network-rg"
      + revision              = "1"
      + service_url           = "https://hmi-apim.staging.platform.hmcts.net"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi+json"
          + content_value  = jsonencode(
                {
                  + basePath = "/health"
                  + host     = "hmi-apim.dev.platform.hmcts.net"
                  + info     = {
                      + title   = "hmi-apim-health-api"
                      + version = "1.0"
                    }
                  + paths    = {
                      + "/liveness" = {
                          + get = {
                              + description = "Liveness Check"
                              + operationId = "liveness-check"
                              + parameters  = []
                              + produces    = [
                                  + "application/json",
                                ]
                              + responses   = {
                                  + "200" = {
                                      + description = ""
                                      + examples    = {
                                          + "application/json" = {
                                              + key = "value"
                                            }
                                        }
                                    }
                                }
                              + summary     = "Liveness Check"
                            }
                        }
                    }
                  + schemes  = [
                      + "http",
                      + "https",
                    ]
                  + swagger  = "2.0"
                  + tags     = []
                }
            )
        }

      + subscription_key_parameter_names {
          + header = (known after apply)
          + query  = (known after apply)
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["publication-health"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-APIM"
      + description         = "Health check for CaTH"
      + display_name        = "Publication Health"
      + id                  = (known after apply)
      + method              = "GET"
      + operation_id        = "publication-health"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/pih/health"

      + request {
          + description = (known after apply)

          + header {
              + default_value = (known after apply)
              + description   = (known after apply)
              + name          = (known after apply)
              + required      = (known after apply)
              + schema_id     = (known after apply)
              + type          = (known after apply)
              + type_name     = (known after apply)
              + values        = (known after apply)

              + example {
                  + description    = (known after apply)
                  + external_value = (known after apply)
                  + name           = (known after apply)
                  + summary        = (known after apply)
                  + value          = (known after apply)
                }
            }

          + query_parameter {
              + default_value = (known after apply)
              + description   = (known after apply)
              + name          = (known after apply)
              + required      = (known after apply)
              + schema_id     = (known after apply)
              + type          = (known after apply)
              + type_name     = (known after apply)
              + values        = (known after apply)

              + example {
                  + description    = (known after apply)
                  + external_value = (known after apply)
                  + name           = (known after apply)
                  + summary        = (known after apply)
                  + value          = (known after apply)
                }
            }

          + representation {
              + content_type = (known after apply)
              + schema_id    = (known after apply)
              + type_name    = (known after apply)

              + example {
                  + description    = (known after apply)
                  + external_value = (known after apply)
                  + name           = (known after apply)
                  + summary        = (known after apply)
                  + value          = (known after apply)
                }

              + form_parameter {
                  + default_value = (known after apply)
                  + description   = (known after apply)
                  + name          = (known after apply)
                  + required      = (known after apply)
                  + schema_id     = (known after apply)
                  + type          = (known after apply)
                  + type_name     = (known after apply)
                  + values        = (known after apply)

                  + example {
                      + description    = (known after apply)
                      + external_value = (known after apply)
                      + name           = (known after apply)
                      + summary        = (known after apply)
                      + value          = (known after apply)
                    }
                }
            }
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation.apim_api_operation["update-publication"] will be created
  + resource "azurerm_api_management_api_operation" "apim_api_operation" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-APIM"
      + description         = "Publication of an artefact"
      + display_name        = "Publication"
      + id                  = (known after apply)
      + method              = "POST"
      + operation_id        = "update-publication"
      + resource_group_name = "ss-stg-network-rg"
      + url_template        = "/pih/publication"

      + request {
          + description = (known after apply)

          + header {
              + default_value = (known after apply)
              + description   = (known after apply)
              + name          = (known after apply)
              + required      = (known after apply)
              + schema_id     = (known after apply)
              + type          = (known after apply)
              + type_name     = (known after apply)
              + values        = (known after apply)

              + example {
                  + description    = (known after apply)
                  + external_value = (known after apply)
                  + name           = (known after apply)
                  + summary        = (known after apply)
                  + value          = (known after apply)
                }
            }

          + query_parameter {
              + default_value = (known after apply)
              + description   = (known after apply)
              + name          = (known after apply)
              + required      = (known after apply)
              + schema_id     = (known after apply)
              + type          = (known after apply)
              + type_name     = (known after apply)
              + values        = (known after apply)

              + example {
                  + description    = (known after apply)
                  + external_value = (known after apply)
                  + name           = (known after apply)
                  + summary        = (known after apply)
                  + value          = (known after apply)
                }
            }

          + representation {
              + content_type = (known after apply)
              + schema_id    = (known after apply)
              + type_name    = (known after apply)

              + example {
                  + description    = (known after apply)
                  + external_value = (known after apply)
                  + name           = (known after apply)
                  + summary        = (known after apply)
                  + value          = (known after apply)
                }

              + form_parameter {
                  + default_value = (known after apply)
                  + description   = (known after apply)
                  + name          = (known after apply)
                  + required      = (known after apply)
                  + schema_id     = (known after apply)
                  + type          = (known after apply)
                  + type_name     = (known after apply)
                  + values        = (known after apply)

                  + example {
                      + description    = (known after apply)
                      + external_value = (known after apply)
                      + name           = (known after apply)
                      + summary        = (known after apply)
                      + value          = (known after apply)
                    }
                }
            }
        }
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["publication-health"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-APIM"
      + id                  = (known after apply)
      + operation_id        = "publication-health"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <rewrite-uri template="/" copy-unmatched-params="true" />
                    <set-backend-service base-url="https://hmi-apim.test.cathHealthCheck.platform.hmcts.net/hmi/" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_apis.azurerm_api_management_api_operation_policy.apim_api_operation_policies["update-publication"] will be created
  + resource "azurerm_api_management_api_operation_policy" "apim_api_operation_policies" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-APIM"
      + id                  = (known after apply)
      + operation_id        = "update-publication"
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <rewrite-uri template="/" copy-unmatched-params="true" />
                    <set-backend-service base-url="https://hmi-apim.test.publication.platform.hmcts.net/hmi/" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_apis.azurerm_api_management_api_policy.apim_api_policy will be created
  + resource "azurerm_api_management_api_policy" "apim_api_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-APIM"
      + id                  = (known after apply)
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <rewrite-uri template="/" copy-unmatched-params="true" />
                    <set-backend-service base-url="https://hmi-apim.test.policy.platform.hmcts.net/hmi/" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_apis.azurerm_api_management_product_api.product will be created
  + resource "azurerm_api_management_product_api" "product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "hmi-APIM"
      + id                  = (known after apply)
      + product_id          = "hmi-product-stg"
      + resource_group_name = "ss-stg-network-rg"
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1,"Program":"tfcmt","SHA1":"","Vars":{}} -->